{
  "min_freq": 1,
  "word2idx": {
    "<PAD>": 0,
    "<UNK>": 1,
    "highly": 2,
    "recommend": 3,
    "this": 4,
    "film": 5,
    "to": 6,
    "everyone": 7,
    "who": 8,
    "loves": 9,
    "movies": 10,
    "every": 11,
    "moment": 12,
    "felt": 13,
    "authentic": 14,
    "and": 15,
    "emotionally": 16,
    "true": 17,
    "beautiful": 18,
    "cinematography": 19,
    "a": 20,
    "heartwarming": 21,
    "emotional": 22,
    "story": 23,
    "the": 24,
    "best": 25,
    "of": 26,
    "year": 27,
    "without": 28,
    "any": 29,
    "question": 30,
    "visuals": 31,
    "were": 32,
    "stunning": 33,
    "was": 34,
    "gripping": 35,
    "worst": 36,
    "movie": 37,
    "i": 38,
    "have": 39,
    "seen": 40,
    "avoid": 41,
    "it": 42,
    "boring": 43,
    "predictable": 44,
    "uninspired": 45,
    "nothing": 46,
    "offer": 47,
    "director": 48,
    "did": 49,
    "an": 50,
    "amazing": 51,
    "job": 52,
    "with": 53,
    "wonderful": 54,
    "adventure": 55,
    "filled": 56,
    "warmth": 57,
    "excitement": 58,
    "plot": 59,
    "nonsensical": 60,
    "acting": 61,
    "wooden": 62,
    "uplifting": 63,
    "that": 64,
    "restores": 65,
    "faith": 66,
    "in": 67,
    "filmmaking": 68,
    "so": 69,
    "bored": 70,
    "almost": 71,
    "fell": 72,
    "asleep": 73,
    "during": 74,
    "perfect": 75,
    "blend": 76,
    "humor": 77,
    "drama": 78,
    "on": 79,
    "level": 80,
    "will": 81,
    "make": 82,
    "you": 83,
    "laugh": 84,
    "cry": 85,
    "think": 86,
    "joyless": 87,
    "experience": 88,
    "from": 89,
    "start": 90,
    "finish": 91,
    "entirely": 92,
    "characters": 93,
    "unlikable": 94,
    "poorly": 95,
    "developed": 96,
    "insult": 97,
    "audiences": 98,
    "everywhere": 99,
    "completely": 100,
    "absolutely": 101,
    "loved": 102,
    "minute": 103,
    "holes": 104,
    "enormous": 105,
    "impossible": 106,
    "ignore": 107,
    "complete": 108,
    "total": 109,
    "disappointment": 110,
    "terrible": 111,
    "dialogue": 112,
    "unconvincing": 113,
    "performances": 114,
    "throughout": 115,
    "ending": 116,
    "deeply": 117,
    "satisfying": 118,
    "cast": 119,
    "delivered": 120,
    "stellar": 121,
    "across": 122,
    "board": 123,
    "special": 124,
    "effects": 125,
    "cheap": 126,
    "script": 127,
    "laughable": 128,
    "both": 129,
    "entertaining": 130,
    "intellectually": 131,
    "stimulating": 132,
    "exceeded": 133,
    "all": 134,
    "my": 135,
    "expectations": 136,
    "great": 137,
    "simply": 138,
    "outstanding": 139,
    "is": 140,
    "cinema": 141,
    "at": 142,
    "its": 143,
    "finest": 144,
    "hated": 145,
    "dreadful": 146,
    "awful": 147,
    "pacing": 148,
    "went": 149,
    "nowhere": 150,
    "bad": 151,
    "unintentionally": 152,
    "funny": 153,
    "kind": 154,
    "stays": 155,
    "lazy": 156,
    "effort": 157,
    "insults": 158,
    "intelligence": 159,
    "viewers": 160,
    "triumphant": 161,
    "return": 162,
    "form": 163,
    "for": 164,
    "talented": 165,
    "misfire": 166,
    "misses": 167,
    "mark": 168,
    "everything": 169,
    "truly": 170,
    "compelling": 171,
    "narrative": 172,
    "two": 173,
    "hours": 174,
    "ever": 175,
    "spent": 176,
    "anywhere": 177,
    "joy": 178,
    "beginning": 179,
    "end": 180,
    "single": 181,
    "incredible": 182,
    "unwatchable": 183,
    "garbage": 184,
    "horrible": 185,
    "paired": 186,
    "solid": 187,
    "storyline": 188,
    "smart": 189,
    "surprisingly": 190,
    "deep": 191,
    "real": 192,
    "treat": 193,
    "one": 194,
    "years": 195,
    "offerings": 196,
    "regret": 197,
    "spending": 198,
    "money": 199,
    "laughed": 200,
    "cried": 201,
    "left": 202,
    "theater": 203,
    "feeling": 204,
    "inspired": 205,
    "about": 206,
    "worked": 207,
    "me": 208,
    "direction": 209,
    "confused": 210,
    "editing": 211,
    "excellent": 212,
    "keeps": 213,
    "edge": 214,
    "has": 215,
    "no": 216,
    "heart": 217,
    "soul": 218,
    "point": 219,
    "directed": 220,
    "awkward": 221,
    "confusion": 222,
    "had": 223,
    "genuine": 224,
    "impact": 225,
    "flawless": 226,
    "perfectly": 227,
    "paced": 228,
    "scene": 229,
    "crafted": 230,
    "care": 231,
    "attention": 232,
    "flat": 233,
    "long": 234,
    "time": 235,
    "trainwreck": 236,
    "epic": 237,
    "proportions": 238,
    "films": 239,
    "recommended": 240,
    "captivating": 241,
    "tale": 242,
    "told": 243,
    "skill": 244,
    "passion": 245,
    "mess": 246,
    "writing": 247,
    "disappointing": 248,
    "sequel": 249,
    "fails": 250,
    "failed": 251,
    "conceivable": 252,
    "possible": 253,
    "powerful": 254,
    "moving": 255,
    "message": 256,
    "captivated": 257,
    "opening": 258,
    "credits": 259,
    "cringe": 260,
    "worthy": 261,
    "unnatural": 262,
    "easily": 263,
    "made": 264,
    "period": 265,
    "delightful": 266,
    "comedy": 267,
    "laughing": 268,
    "soundtrack": 269,
    "depth": 270,
    "tedious": 271,
    "bore": 272,
    "dragged": 273,
    "far": 274,
    "too": 275,
    "thoroughly": 276,
    "entertained": 277,
    "heartfelt": 278,
    "blown": 279,
    "away": 280,
    "by": 281,
    "quality": 282,
    "production": 283,
    "offense": 284,
    "good": 285,
    "taste": 286,
    "superb": 287,
    "cleverly": 288,
    "written": 289,
    "not": 290,
    "performance": 291,
    "convincing": 292,
    "cannot": 293,
    "believe": 294,
    "received": 295,
    "positive": 296,
    "reviews": 297,
    "fantastic": 298,
    "expectation": 299,
    "magical": 300,
    "transported": 301,
    "full": 302,
    "cliches": 303,
    "remarkable": 304,
    "sets": 305,
    "new": 306,
    "standard": 307,
    "hollow": 308,
    "empty": 309,
    "substance": 310,
    "or": 311,
    "meaning": 312,
    "sense": 313,
    "catastrophic": 314,
    "failure": 315,
    "department": 316,
    "never": 317,
    "been": 318,
    "disappointed": 319,
    "life": 320,
    "wasted": 321,
    "potential": 322,
    "execution": 323,
    "deserves": 324,
    "praise": 325,
    "breathtaking": 326,
    "proves": 327,
    "stories": 328,
    "get": 329,
    "old": 330,
    "whatsoever": 331,
    "pure": 332,
    "cinematic": 333,
    "gold": 334,
    "way": 335,
    "forgettable": 336,
    "waste": 337,
    "talent": 338,
    "genuinely": 339,
    "touching": 340,
    "earns": 341,
    "emotion": 342,
    "going": 343,
    "moved": 344,
    "tears": 345,
    "dull": 346,
    "lifeless": 347,
    "redeeming": 348,
    "qualities": 349,
    "imaginable": 350
  },
  "word_counts": {
    "highly": 2,
    "recommend": 1,
    "this": 28,
    "film": 18,
    "to": 13,
    "everyone": 2,
    "who": 1,
    "loves": 1,
    "movies": 1,
    "every": 13,
    "moment": 2,
    "felt": 1,
    "authentic": 1,
    "and": 41,
    "emotionally": 1,
    "true": 1,
    "beautiful": 3,
    "cinematography": 1,
    "a": 33,
    "heartwarming": 1,
    "emotional": 3,
    "story": 9,
    "the": 48,
    "best": 4,
    "of": 14,
    "year": 2,
    "without": 1,
    "any": 2,
    "question": 1,
    "visuals": 1,
    "were": 5,
    "stunning": 1,
    "was": 17,
    "gripping": 1,
    "worst": 3,
    "movie": 17,
    "i": 8,
    "have": 4,
    "seen": 2,
    "avoid": 2,
    "it": 6,
    "boring": 1,
    "predictable": 2,
    "uninspired": 1,
    "nothing": 3,
    "offer": 1,
    "director": 2,
    "did": 1,
    "an": 5,
    "amazing": 2,
    "job": 1,
    "with": 14,
    "wonderful": 3,
    "adventure": 2,
    "filled": 1,
    "warmth": 1,
    "excitement": 1,
    "plot": 4,
    "nonsensical": 1,
    "acting": 5,
    "wooden": 1,
    "uplifting": 1,
    "that": 13,
    "restores": 1,
    "faith": 1,
    "in": 7,
    "filmmaking": 1,
    "so": 3,
    "bored": 1,
    "almost": 2,
    "fell": 1,
    "asleep": 1,
    "during": 1,
    "perfect": 2,
    "blend": 1,
    "humor": 1,
    "drama": 1,
    "on": 7,
    "level": 3,
    "will": 1,
    "make": 1,
    "you": 3,
    "laugh": 1,
    "cry": 1,
    "think": 1,
    "joyless": 1,
    "experience": 4,
    "from": 6,
    "start": 4,
    "finish": 4,
    "entirely": 3,
    "characters": 3,
    "unlikable": 1,
    "poorly": 2,
    "developed": 1,
    "insult": 1,
    "audiences": 1,
    "everywhere": 2,
    "completely": 4,
    "absolutely": 4,
    "loved": 4,
    "minute": 2,
    "holes": 1,
    "enormous": 1,
    "impossible": 1,
    "ignore": 1,
    "complete": 1,
    "total": 2,
    "disappointment": 1,
    "terrible": 7,
    "dialogue": 4,
    "unconvincing": 1,
    "performances": 6,
    "throughout": 6,
    "ending": 1,
    "deeply": 2,
    "satisfying": 1,
    "cast": 1,
    "delivered": 1,
    "stellar": 1,
    "across": 1,
    "board": 1,
    "special": 1,
    "effects": 2,
    "cheap": 1,
    "script": 2,
    "laughable": 1,
    "both": 1,
    "entertaining": 1,
    "intellectually": 1,
    "stimulating": 1,
    "exceeded": 2,
    "all": 5,
    "my": 2,
    "expectations": 1,
    "great": 4,
    "simply": 1,
    "outstanding": 2,
    "is": 6,
    "cinema": 1,
    "at": 4,
    "its": 1,
    "finest": 1,
    "hated": 1,
    "dreadful": 1,
    "awful": 4,
    "pacing": 2,
    "went": 1,
    "nowhere": 1,
    "bad": 3,
    "unintentionally": 1,
    "funny": 2,
    "kind": 1,
    "stays": 1,
    "lazy": 2,
    "effort": 1,
    "insults": 1,
    "intelligence": 1,
    "viewers": 1,
    "triumphant": 1,
    "return": 1,
    "form": 1,
    "for": 4,
    "talented": 1,
    "misfire": 1,
    "misses": 1,
    "mark": 1,
    "everything": 1,
    "truly": 2,
    "compelling": 2,
    "narrative": 1,
    "two": 1,
    "hours": 1,
    "ever": 2,
    "spent": 1,
    "anywhere": 1,
    "joy": 1,
    "beginning": 1,
    "end": 2,
    "single": 3,
    "incredible": 3,
    "unwatchable": 1,
    "garbage": 1,
    "horrible": 2,
    "paired": 1,
    "solid": 1,
    "storyline": 1,
    "smart": 1,
    "surprisingly": 1,
    "deep": 1,
    "real": 2,
    "treat": 1,
    "one": 3,
    "years": 1,
    "offerings": 1,
    "regret": 1,
    "spending": 1,
    "money": 1,
    "laughed": 1,
    "cried": 1,
    "left": 1,
    "theater": 1,
    "feeling": 1,
    "inspired": 1,
    "about": 1,
    "worked": 1,
    "me": 2,
    "direction": 3,
    "confused": 1,
    "editing": 1,
    "excellent": 1,
    "keeps": 1,
    "edge": 1,
    "has": 3,
    "no": 7,
    "heart": 2,
    "soul": 1,
    "point": 1,
    "directed": 1,
    "awkward": 1,
    "confusion": 1,
    "had": 3,
    "genuine": 1,
    "impact": 1,
    "flawless": 1,
    "perfectly": 1,
    "paced": 1,
    "scene": 2,
    "crafted": 1,
    "care": 1,
    "attention": 1,
    "flat": 1,
    "long": 2,
    "time": 1,
    "trainwreck": 1,
    "epic": 1,
    "proportions": 1,
    "films": 2,
    "recommended": 1,
    "captivating": 1,
    "tale": 1,
    "told": 1,
    "skill": 1,
    "passion": 1,
    "mess": 1,
    "writing": 2,
    "disappointing": 1,
    "sequel": 1,
    "fails": 1,
    "failed": 1,
    "conceivable": 1,
    "possible": 4,
    "powerful": 2,
    "moving": 2,
    "message": 1,
    "captivated": 1,
    "opening": 1,
    "credits": 1,
    "cringe": 1,
    "worthy": 1,
    "unnatural": 1,
    "easily": 1,
    "made": 3,
    "period": 1,
    "delightful": 1,
    "comedy": 1,
    "laughing": 1,
    "soundtrack": 1,
    "depth": 1,
    "tedious": 1,
    "bore": 1,
    "dragged": 1,
    "far": 1,
    "too": 1,
    "thoroughly": 1,
    "entertained": 1,
    "heartfelt": 1,
    "blown": 1,
    "away": 1,
    "by": 3,
    "quality": 2,
    "production": 1,
    "offense": 1,
    "good": 1,
    "taste": 1,
    "superb": 1,
    "cleverly": 1,
    "written": 1,
    "not": 1,
    "performance": 1,
    "convincing": 1,
    "cannot": 1,
    "believe": 1,
    "received": 2,
    "positive": 1,
    "reviews": 1,
    "fantastic": 1,
    "expectation": 1,
    "magical": 1,
    "transported": 1,
    "full": 1,
    "cliches": 1,
    "remarkable": 1,
    "sets": 1,
    "new": 1,
    "standard": 1,
    "hollow": 1,
    "empty": 1,
    "substance": 1,
    "or": 1,
    "meaning": 1,
    "sense": 2,
    "catastrophic": 1,
    "failure": 1,
    "department": 1,
    "never": 2,
    "been": 1,
    "disappointed": 1,
    "life": 1,
    "wasted": 1,
    "potential": 1,
    "execution": 1,
    "deserves": 1,
    "praise": 1,
    "breathtaking": 1,
    "proves": 1,
    "stories": 1,
    "get": 1,
    "old": 1,
    "whatsoever": 1,
    "pure": 1,
    "cinematic": 1,
    "gold": 1,
    "way": 2,
    "forgettable": 1,
    "waste": 1,
    "talent": 1,
    "genuinely": 1,
    "touching": 2,
    "earns": 1,
    "emotion": 1,
    "going": 1,
    "moved": 1,
    "tears": 1,
    "dull": 1,
    "lifeless": 1,
    "redeeming": 1,
    "qualities": 1,
    "imaginable": 1
  }
}