{
  "min_freq": 1,
  "word2idx": {
    "<PAD>": 0,
    "<UNK>": 1,
    "good": 2,
    "performances": 3,
    "story": 4,
    "and": 5,
    "direction": 6,
    "make": 7,
    "this": 8,
    "worthwhile": 9,
    "i": 10,
    "thoroughly": 11,
    "enjoyed": 12,
    "every": 13,
    "moment": 14,
    "of": 15,
    "beautifully": 16,
    "crafted": 17,
    "film": 18,
    "did": 19,
    "not": 20,
    "like": 21,
    "movie": 22,
    "the": 23,
    "pacing": 24,
    "was": 25,
    "slow": 26,
    "ending": 27,
    "weak": 28,
    "is": 29,
    "cinema": 30,
    "at": 31,
    "its": 32,
    "absolute": 33,
    "peak": 34,
    "a": 35,
    "completely": 36,
    "unforgettable": 37,
    "experience": 38,
    "soso": 39,
    "that": 40,
    "left": 41,
    "me": 42,
    "feeling": 43,
    "fairly": 44,
    "indifferent": 45,
    "overall": 46,
    "very": 47,
    "poor": 48,
    "effort": 49,
    "from": 50,
    "everyone": 51,
    "involved": 52,
    "deeply": 53,
    "unsatisfying": 54,
    "most": 55,
    "extraordinary": 56,
    "have": 57,
    "ever": 58,
    "seen": 59,
    "in": 60,
    "my": 61,
    "entire": 62,
    "life": 63,
    "bad": 64,
    "enjoy": 65,
    "it": 66,
    "all": 67,
    "an": 68,
    "underwhelming": 69,
    "with": 70,
    "too": 71,
    "many": 72,
    "flaws": 73,
    "to": 74,
    "overlook": 75,
    "perfectly": 76,
    "average": 77,
    "some": 78,
    "moments": 79,
    "absolutely": 80,
    "magnificent": 81,
    "filmmaking": 82,
    "highest": 83,
    "order": 84,
    "imaginable": 85,
    "worth": 86,
    "watching": 87,
    "if": 88,
    "you": 89,
    "genre": 90,
    "abomination": 91,
    "worst": 92,
    "thing": 93,
    "made": 94,
    "real": 95,
    "mess": 96,
    "confusing": 97,
    "poorly": 98,
    "written": 99,
    "boring": 100,
    "brilliant": 101,
    "could": 102,
    "take": 103,
    "eyes": 104,
    "off": 105,
    "screen": 106,
    "horrendous": 107,
    "conceivable": 108,
    "way": 109,
    "true": 110,
    "cinematic": 111,
    "catastrophe": 112,
    "passable": 113,
    "interesting": 114,
    "ideas": 115,
    "were": 116,
    "half": 117,
    "developed": 118,
    "your": 119,
    "time": 120,
    "execution": 121,
    "failed": 122,
    "match": 123,
    "ambitious": 124,
    "idea": 125,
    "okay": 126,
    "nothing": 127,
    "special": 128,
    "but": 129,
    "terrible": 130,
    "either": 131,
    "mostly": 132,
    "succeeds": 133,
    "what": 134,
    "sets": 135,
    "out": 136,
    "do": 137,
    "genuinely": 138,
    "awful": 139,
    "bored": 140,
    "frustrated": 141,
    "dimension": 142,
    "masterwork": 143,
    "demands": 144,
    "be": 145,
    "unconvincingly": 146,
    "acted": 147,
    "falls": 148,
    "flat": 149,
    "dreadful": 150,
    "writing": 151,
    "unconvincing": 152,
    "liked": 153,
    "more": 154,
    "than": 155,
    "expected": 156,
    "pleasant": 157,
    "engaging": 158,
    "watch": 159,
    "quite": 160,
    "bit": 161,
    "entertaining": 162,
    "well": 163,
    "kept": 164,
    "engaged": 165,
    "throughout": 166,
    "nice": 167,
    "horrifying": 168,
    "waste": 169,
    "everyones": 170,
    "talent": 171,
    "money": 172,
    "unforgivable": 173,
    "lifechanging": 174,
    "incomparable": 175,
    "beauty": 176,
    "wisdom": 177,
    "emotional": 178,
    "power": 179,
    "repulsive": 180,
    "acting": 181,
    "catastrophically": 182,
    "hits": 183,
    "marks": 184,
    "delivers": 185,
    "satisfying": 186,
    "greatest": 187,
    "once": 188,
    "lifetime": 189,
    "masterpiece": 190,
    "one": 191,
    "without": 192,
    "doubt": 193,
    "unwatchable": 194,
    "history": 195,
    "competently": 196,
    "executes": 197,
    "familiar": 198,
    "had": 199,
    "problems": 200,
    "again": 201,
    "want": 202,
    "two": 203,
    "hours": 204,
    "back": 205,
    "destroyed": 206,
    "will": 207,
    "live": 208,
    "hated": 209,
    "single": 210,
    "second": 211,
    "catastrophic": 212,
    "disaster": 213,
    "pleasantly": 214,
    "entertained": 215,
    "by": 216,
    "enjoyable": 217,
    "fine": 218,
    "also": 219,
    "solid": 220,
    "simply": 221,
    "profound": 222,
    "beautiful": 223,
    "encountered": 224,
    "neither": 225,
    "great": 226,
    "nor": 227,
    "just": 228,
    "plain": 229,
    "ordinary": 230,
    "struggled": 231,
    "finish": 232,
    "predictable": 233,
    "plot": 234,
    "little": 235,
    "sense": 236,
    "characters": 237,
    "fantastic": 238,
    "would": 239,
    "enthusiastically": 240,
    "recommend": 241,
    "people": 242,
    "perfect": 243,
    "immortal": 244,
    "work": 245,
    "celebrated": 246,
    "forever": 247,
    "about": 248,
    "really": 249,
    "excited": 250,
    "outstanding": 251,
    "gripping": 252,
    "never": 253,
    "felt": 254,
    "so": 255,
    "offended": 256,
    "trash": 257,
    "mediocre": 258,
    "best": 259,
    "several": 260,
    "frustrating": 261,
    "issues": 262,
    "mixed": 263,
    "feelings": 264,
    "potential": 265,
    "fell": 266,
    "short": 267,
    "almost": 268,
    "worked": 269,
    "for": 270,
    "engage": 271,
    "found": 272,
    "dull": 273,
    "tedious": 274,
    "executed": 275,
    "ultimately": 276,
    "complete": 277,
    "letdown": 278,
    "likeable": 279,
    "disgusting": 280,
    "embarrassing": 281,
    "on": 282,
    "level": 283,
    "middling": 284,
    "impressed": 285,
    "disappointed": 286,
    "trailer": 287,
    "promised": 288,
    "much": 289,
    "delivered": 290,
    "garbage": 291,
    "deserves": 292,
    "erased": 293,
    "existence": 294,
    "permanently": 295,
    "moved": 296,
    "tears": 297,
    "changed": 298,
    "how": 299,
    "see": 300,
    "world": 301,
    "truly": 302,
    "standout": 303,
    "powerful": 304,
    "utter": 305,
    "failure": 306,
    "insults": 307,
    "audience": 308,
    "turn": 309,
    "forgettable": 310,
    "squandered": 311,
    "promising": 312,
    "premise": 313,
    "decent": 314,
    "enough": 315,
    "pass": 316,
    "less": 317,
    "painful": 318,
    "viewing": 319,
    "towering": 320,
    "achievement": 321,
    "landmark": 322,
    "after": 323,
    "loved": 324,
    "everything": 325,
    "exceptional": 326,
    "keep": 327,
    "interest": 328,
    "staggeringly": 329,
    "transcends": 330,
    "expectation": 331,
    "suppose": 332,
    "think": 333,
    "no": 334,
    "question": 335,
    "total": 336,
    "start": 337,
    "wonderful": 338,
    "rich": 339,
    "should": 340,
    "been": 341,
    "am": 342,
    "furious": 343,
    "strongly": 344,
    "advise": 345,
    "avoid": 346,
    "satisfied": 347,
    "flawless": 348,
    "genius": 349,
    "breathtaking": 350,
    "storm": 351,
    "vision": 352,
    "storytelling": 353,
    "works": 354,
    "levels": 355,
    "such": 356,
    "walked": 357,
    "multiple": 358,
    "times": 359
  },
  "word_counts": {
    "good": 10,
    "performances": 5,
    "story": 8,
    "and": 35,
    "direction": 3,
    "make": 1,
    "this": 34,
    "worthwhile": 1,
    "i": 29,
    "thoroughly": 1,
    "enjoyed": 2,
    "every": 9,
    "moment": 1,
    "of": 12,
    "beautifully": 1,
    "crafted": 2,
    "film": 33,
    "did": 2,
    "not": 10,
    "like": 1,
    "movie": 19,
    "the": 28,
    "pacing": 2,
    "was": 21,
    "slow": 2,
    "ending": 1,
    "weak": 3,
    "is": 11,
    "cinema": 3,
    "at": 4,
    "its": 4,
    "absolute": 3,
    "peak": 1,
    "a": 49,
    "completely": 2,
    "unforgettable": 1,
    "experience": 10,
    "soso": 1,
    "that": 20,
    "left": 2,
    "me": 8,
    "feeling": 1,
    "fairly": 1,
    "indifferent": 2,
    "overall": 1,
    "very": 5,
    "poor": 2,
    "effort": 2,
    "from": 3,
    "everyone": 3,
    "involved": 1,
    "deeply": 3,
    "unsatisfying": 1,
    "most": 6,
    "extraordinary": 2,
    "have": 6,
    "ever": 5,
    "seen": 3,
    "in": 9,
    "my": 6,
    "entire": 3,
    "life": 2,
    "bad": 7,
    "enjoy": 2,
    "it": 16,
    "all": 3,
    "an": 6,
    "underwhelming": 1,
    "with": 10,
    "too": 2,
    "many": 2,
    "flaws": 2,
    "to": 16,
    "overlook": 1,
    "perfectly": 1,
    "average": 2,
    "some": 4,
    "moments": 3,
    "absolutely": 5,
    "magnificent": 1,
    "filmmaking": 5,
    "highest": 1,
    "order": 1,
    "imaginable": 1,
    "worth": 4,
    "watching": 3,
    "if": 1,
    "you": 1,
    "genre": 2,
    "abomination": 2,
    "worst": 2,
    "thing": 1,
    "made": 6,
    "real": 1,
    "mess": 1,
    "confusing": 1,
    "poorly": 4,
    "written": 2,
    "boring": 2,
    "brilliant": 2,
    "could": 1,
    "take": 1,
    "eyes": 1,
    "off": 1,
    "screen": 1,
    "horrendous": 1,
    "conceivable": 2,
    "way": 5,
    "true": 3,
    "cinematic": 1,
    "catastrophe": 1,
    "passable": 1,
    "interesting": 1,
    "ideas": 1,
    "were": 2,
    "half": 1,
    "developed": 2,
    "your": 2,
    "time": 5,
    "execution": 1,
    "failed": 2,
    "match": 1,
    "ambitious": 1,
    "idea": 1,
    "okay": 1,
    "nothing": 5,
    "special": 1,
    "but": 4,
    "terrible": 2,
    "either": 2,
    "mostly": 1,
    "succeeds": 1,
    "what": 1,
    "sets": 1,
    "out": 2,
    "do": 2,
    "genuinely": 2,
    "awful": 4,
    "bored": 1,
    "frustrated": 1,
    "dimension": 1,
    "masterwork": 1,
    "demands": 1,
    "be": 4,
    "unconvincingly": 1,
    "acted": 1,
    "falls": 1,
    "flat": 1,
    "dreadful": 3,
    "writing": 1,
    "unconvincing": 2,
    "liked": 2,
    "more": 3,
    "than": 2,
    "expected": 1,
    "pleasant": 1,
    "engaging": 2,
    "watch": 3,
    "quite": 3,
    "bit": 1,
    "entertaining": 2,
    "well": 3,
    "kept": 1,
    "engaged": 1,
    "throughout": 3,
    "nice": 1,
    "horrifying": 1,
    "waste": 1,
    "everyones": 1,
    "talent": 2,
    "money": 1,
    "unforgivable": 1,
    "lifechanging": 1,
    "incomparable": 1,
    "beauty": 1,
    "wisdom": 1,
    "emotional": 2,
    "power": 1,
    "repulsive": 1,
    "acting": 2,
    "catastrophically": 1,
    "hits": 1,
    "marks": 1,
    "delivers": 2,
    "satisfying": 2,
    "greatest": 2,
    "once": 1,
    "lifetime": 1,
    "masterpiece": 2,
    "one": 1,
    "without": 1,
    "doubt": 1,
    "unwatchable": 1,
    "history": 1,
    "competently": 1,
    "executes": 1,
    "familiar": 1,
    "had": 4,
    "problems": 1,
    "again": 2,
    "want": 1,
    "two": 1,
    "hours": 1,
    "back": 1,
    "destroyed": 1,
    "will": 3,
    "live": 1,
    "hated": 1,
    "single": 1,
    "second": 1,
    "catastrophic": 1,
    "disaster": 2,
    "pleasantly": 1,
    "entertained": 1,
    "by": 2,
    "enjoyable": 1,
    "fine": 3,
    "also": 1,
    "solid": 2,
    "simply": 1,
    "profound": 1,
    "beautiful": 1,
    "encountered": 1,
    "neither": 2,
    "great": 3,
    "nor": 2,
    "just": 1,
    "plain": 1,
    "ordinary": 1,
    "struggled": 1,
    "finish": 2,
    "predictable": 1,
    "plot": 2,
    "little": 1,
    "sense": 1,
    "characters": 3,
    "fantastic": 1,
    "would": 2,
    "enthusiastically": 1,
    "recommend": 2,
    "people": 1,
    "perfect": 3,
    "immortal": 1,
    "work": 2,
    "celebrated": 1,
    "forever": 1,
    "about": 6,
    "really": 2,
    "excited": 1,
    "outstanding": 1,
    "gripping": 1,
    "never": 2,
    "felt": 2,
    "so": 1,
    "offended": 1,
    "trash": 1,
    "mediocre": 1,
    "best": 1,
    "several": 1,
    "frustrating": 1,
    "issues": 1,
    "mixed": 1,
    "feelings": 1,
    "potential": 1,
    "fell": 1,
    "short": 1,
    "almost": 2,
    "worked": 1,
    "for": 1,
    "engage": 1,
    "found": 1,
    "dull": 2,
    "tedious": 1,
    "executed": 1,
    "ultimately": 1,
    "complete": 2,
    "letdown": 1,
    "likeable": 1,
    "disgusting": 1,
    "embarrassing": 1,
    "on": 2,
    "level": 1,
    "middling": 1,
    "impressed": 1,
    "disappointed": 2,
    "trailer": 1,
    "promised": 1,
    "much": 1,
    "delivered": 1,
    "garbage": 1,
    "deserves": 1,
    "erased": 1,
    "existence": 1,
    "permanently": 1,
    "moved": 2,
    "tears": 1,
    "changed": 1,
    "how": 1,
    "see": 1,
    "world": 2,
    "truly": 2,
    "standout": 1,
    "powerful": 1,
    "utter": 1,
    "failure": 1,
    "insults": 1,
    "audience": 1,
    "turn": 1,
    "forgettable": 1,
    "squandered": 1,
    "promising": 1,
    "premise": 1,
    "decent": 1,
    "enough": 2,
    "pass": 1,
    "less": 1,
    "painful": 1,
    "viewing": 2,
    "towering": 1,
    "achievement": 1,
    "landmark": 1,
    "after": 1,
    "loved": 1,
    "everything": 1,
    "exceptional": 1,
    "keep": 1,
    "interest": 1,
    "staggeringly": 1,
    "transcends": 1,
    "expectation": 1,
    "suppose": 1,
    "think": 1,
    "no": 1,
    "question": 1,
    "total": 1,
    "start": 1,
    "wonderful": 2,
    "rich": 1,
    "should": 1,
    "been": 1,
    "am": 1,
    "furious": 1,
    "strongly": 1,
    "advise": 1,
    "avoid": 1,
    "satisfied": 1,
    "flawless": 1,
    "genius": 1,
    "breathtaking": 1,
    "storm": 1,
    "vision": 1,
    "storytelling": 1,
    "works": 1,
    "levels": 1,
    "such": 1,
    "walked": 1,
    "multiple": 1,
    "times": 1
  }
}